tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client maxusers="300000" host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="p.sberlabs.io" port="8080" type="tcp"></server>
</servers>

<load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
  <arrivalphase phase="1" duration="1" unit="minute">
    <users maxnumber="300000" arrivalrate="5000" unit="second"></users>
  </arrivalphase>
</load>

<options>
  <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
  </option>
</options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
   <session name="http-example" probability="100" type="ts_http">
    <!-- full url with server name, this overrides the "server" config value -->
     <request> <http url="/img/p.png?mid=ajhjsdb" method="GET" version="1.1"></http> </request>
   </session>
</sessions>

</tsung>